src/capra_filters/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2016-05-29 Sun 10:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Capra" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. capra<sub>filters</sub></a>
<ul>
<li><a href="#sec-1-1">1.1. Manager</a></li>
<li><a href="#sec-1-2">1.2. Filters</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. <code>capra_filters/resize</code></a></li>
<li><a href="#sec-1-2-2">1.2.2. <code>capra_filters/blur_filter</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Tools</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Perspective Calibration</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Adding a filter</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> capra<sub>filters</sub></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Manager</h3>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Filters</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <code>capra_filters/resize</code></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Resize an image to the given size
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>IO<br  /><div class="outline-text-5" id="text-1-2-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">input</td>
<td class="left">Image</td>
</tr>

<tr>
<td class="left">output</td>
<td class="left">Image</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>Parameters<br  /><div class="outline-text-5" id="text-1-2-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">width</td>
<td class="left">int</td>
<td class="left">Width of the output image</td>
</tr>

<tr>
<td class="left">height</td>
<td class="left">int</td>
<td class="left">Height of the output image</td>
</tr>
</tbody>
</table>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> <code>capra_filters/blur_filter</code></h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Simple kernel blur filter
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>IO<br  /><div class="outline-text-5" id="text-1-2-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">input</td>
<td class="left">Image</td>
</tr>

<tr>
<td class="left">output</td>
<td class="left">Image</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Parameters<br  /><div class="outline-text-5" id="text-1-2-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">ksize</td>
<td class="left">int</td>
<td class="left">The size of the kernel</td>
</tr>
</tbody>
</table>
</div>
</li></ol>
</div>
</div>



<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Tools</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Perspective Calibration</h4>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Adding a filter</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Create filter<sub>name</sub>.{cfg,cpp}
</li>
<li>Add the files to the CMakeLists.txt
</li>
<li>Make the config file executable (chmod +x filter<sub>name</sub>.cfg)
</li>
<li>Add the nodelet to nodelet<sub>plugings</sub>.xml
</li>
<li>catkin<sub>make</sub>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Capra</p>
<p class="date">Created: 2016-05-29 Sun 10:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
